# ================================================ 配置区 ================================================
# TODO:系统监控
from system import SysProcess
from system import ListenPort
from system import WebAppStatus
from system import TelnetPort
from system import Disk
# =========================================================================================================
# TODO:Docker容器监控
from dockers import ContainerStatus

# =========================================================================================================


if __name__ == '__main__':
    # TODO:系统监控以下根据需求选择开启 不用的请注释
    # ================================================ 硬盘监控 ================================================
    Disk.showDisk().disk_info()
    # ================================================ 进程监控 ================================================
    # 进程监控 建议与supervisor 进行使用 此功能不涉及进程重启 只监控状态
    SysProcess.check_servername()
    # ================================================ 本机端口监控 =============================================
    ListenPort.listen().Tcp_Connect()
    # ================================================ 网站监控 ================================================
    WebAppStatus.check().status_url()
    # ================================== Telnet 多台主机多个端口监控 =============================================
    TelnetPort.Telnet().ChekPort()
    # =========================================================================================================

    # TODO:Docker容器监控配置根据需求选择开启 不用的请注释
    # ================================== Docker 多台主机多个容器监控 =============================================
    ContainerStatus.Container().Docker_status()
    # =========================================================================================================
