# ================================================ 配置区 ================================================
from system import SysProcess
from system import ListenPort
from system import WebAppStatus
from system import TelnetPort
from system import Disk

if __name__ == '__main__':
    # TODO:以下配置根据需求选择开启 不用的请注释
    # ================================================ 硬盘监控 ================================================
    Disk.showDisk().disk_info()
    # ================================================ 进程监控 ================================================
    # 进程监控 建议与supervisor 进行使用 此功能不涉及进程重启 只监控状态
    SysProcess.check_servername()
    # ================================================ 本机端口监控 =============================================
    ListenPort.listen().Tcp_Connect()
    # ================================================ 网站监控 ================================================
    WebAppStatus.check().status_url()
    # ================================== Telnet 多台主机多个端口监控 =============================================
    TelnetPort.Telnet().ChekPort()
    # =========================================================================================================
